TexasInstruments/simplelink-wifi-examples/examples/rtos/LP_EM_CC35X1ET/demos/power_measurement/freertos/power_measurement.syscfg
/**
 * Import the modules used in this configuration.
 */
const FreeRTOS              = scripting.addModule("/freertos/FreeRTOS");
const CryptoKeyKeyStore_PSA = scripting.addModule("/ti/drivers/CryptoKeyKeyStore_PSA");
const GPIO                  = scripting.addModule("/ti/drivers/GPIO");
const GPIO1                 = GPIO.addInstance();
const Power                 = scripting.addModule("/ti/drivers/Power");
const UART2                 = scripting.addModule("/ti/drivers/UART2");
const UART21                = UART2.addInstance();
const UART22                = UART2.addInstance();
const Settings              = scripting.addModule("/ti/posix/freertos/Settings");
const ble                   = scripting.addModule("/ti/rfstacks/ble/ble");
const wifi                  = scripting.addModule("/ti/rfstacks/wifi/wifi");
// @cliArgs --board /ti/boards/LP_EM_CC35X1ET --rtos freertos

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.useTimeSlicing = true;

/*for STA only to get max tp ,set heapSize to 0x00042000 */
/*for STA and AP (MR) only to get max tp ,set heapSize to 0x00050000 */
FreeRTOS.heapSize = 0x00057000;

GPIO1.$hardware = system.deviceData.board.components.LED_RED;
GPIO1.$name     = "CONFIG_GPIO_LED_0";

UART21.$name                     = "CONFIG_UART2_0";
UART21.$hardware                 = system.deviceData.board.components.XDS110UART;
UART21.uart.dmaTxChannel.$assign = "DMA_CH2";
UART21.uart.dmaRxChannel.$assign = "DMA_CH3";

UART22.$name = "CONFIG_UART2_1";

ble.Default_Tx_Power = 0;

wifi.ANT_SEL_pull_val       = 3;
wifi.COEX_REQ_pull_val      = 3;
wifi.COEX_PRIORITY_pull_val = 3;
wifi.UART1_CTS_pull_val     = 3;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.gpioPin.$suggestSolution            = "boosterpack.31";
UART21.uart.$suggestSolution              = "UART1";
UART21.uart.txPin.$suggestSolution        = "GPIO5";
UART21.uart.rxPin.$suggestSolution        = "GPIO6";
UART22.uart.$suggestSolution              = "UART0";
UART22.uart.dmaTxChannel.$suggestSolution = "DMA_CH1";
UART22.uart.dmaRxChannel.$suggestSolution = "DMA_CH0";
UART22.uart.txPin.$suggestSolution        = "boosterpack.4";
UART22.uart.rxPin.$suggestSolution        = "boosterpack.3";

